mmds.org
#+SETUPFILE: setup/theme-readtheorg.setup
#+EXPORT_FILE_NAME: dist/mmds.html
#+OPTIONS: toc:3
#+TITLE: Mining of massive data sets course notes

* Week 1 Map Reduce Paradigm
Whats so cool about this?
MapReduce paradigm emerged to make cluster computing easier (from a programming perspective).
The goal was to abstract out the various difficulties in cluster computing like:
Handling node failures, complexities of distributed computing.

** MapReduce Programming Model:
Map -> Group by Key -> Reduce 

Map Function: Takes the input and returns (key, val) pairs.
Group by Key: Combine same keys
Reduce: Do some transformation and return result for the (key, [v1 ,v2 ...]) group.

** Scheduling and Data Flow
   MR system partitions the input data and stores them on multiple nodes.
   Schedules the programs execution, and inter-node communications.
   Files are redundantly chunked and stored on multiple nodes.
   
   There is a masternode that has all the file metadata and takes care of the coordination.
   Master is typically not replicated, so when it fails, the task is aborted.
   
*The input and final output* are stored in the dfs.
*intermediate results* are stored on the map/reduce worker nodes.

*** Number of Map And Reduce tasks required per job
M map tasks, R reduce tasks.
Rule of thumb:
 M much larger than the number of nodes in the cluster.
 R is typically smaller than M.
The output is spread across the number of reducer nodes, fewer the better.

Multiple nodes do map and reduce tasks.
** Refinements
*** Combiners
Between Mappers and Reducer.
To save network time, the combiner pre-aggregates/transforms values with same key before sending to reducer.
ex) In the wordcount example, if from the map task running on a single node, we get (foo, 1), (foo, 1).
The combiner on that node, will combine them to (foo, 2). And only this value is sent to the reducer.

Programmer provides the combinde function :: (K, V1) -> V2
*Note* Combiner trick works only if the reduce fn is commutative and associative.
ex) sum fn can use the combiner trick,
    but average fn cannot. (because average fn is not commutative and associative) We can instead make the combiner send the total sum and number of values. The reducer can use this 
and compute the average.

*** Partition Function
This is provided by the map reduce system.
However, sometimes its useful to override the default partition fn. (Check the hostname/url example in the slides)

* Week 1 Analysis of large graphs
** Link Analysis and Page Rank
We'll Analyze the webgraph as an example
Main idea:
Compute important scores for nodes in a graph.
These methods are called link analysis:
- page rank
- hubs and authorities (hits)
- topic-specific (personalized) pagerank
- web spam detection algorithms
  
*** Mathematical Formulation for the Page Rank algorithm

**** Flow formulation
     Basic Idea:
Think of in-links as votes.
The in-link from a important page has higher weight than one from a less important page.
Recursive formulation!!

If page 'j' has importance r_j and and 'n' out-links, 
- weight of each out-link is r_j/n

The rank r_j for page j is
r_j = \sum r_i/d_i \forall nodes i that point to j with rank r_i and out-degree d_i

Add an addition constraint \sum r_j \forall j in graph to be 1. (This enforces uniqueness)

But this methods requires solving a bunch of equations. Guassian Elimination will work for small graphs, but not at the webscale!!

**** Matrix formulation
The above formulation can be rewritten as a eigen-vector formulation.

If page i has d out-links
Matrix M_ji = 1/d_i where d_i is the out-degree of node i.

The Matrix M is column stochastic as every column sums to one.
i.e) column i represents all the out-links from i. 
Thus the page rank formulation can be written as r = Mr.
Rank vector r is the eigen vector of the web-matrix M.

This can be efficiently computed using many methods. One such method is power-iteration.

Power Iteration:
- Start with r_0 = [1/N, 1/N ...]^T
As there are N webpages.
- r_1 = Mr_0
- Keep Iterating unitl (r_1 - r_0) < \epsilon
- r_1 - r_0 is L1 norm, it can be any vector norm.

