mmds.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-11 Tue 16:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Mining of massive data sets course notes</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="siddharth subramaniyam" />
<link rel="stylesheet" type="text/css" href="https://rawgit.com/subsid/notes/master/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://rawgit.com/subsid/notes/master/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Mining of massive data sets course notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline7">1. Week 1 Map Reduce Paradigm</a>
<ul>
<li><a href="#orgheadline1">1.1. MapReduce Programming Model:</a></li>
<li><a href="#orgheadline3">1.2. Scheduling and Data Flow</a>
<ul>
<li><a href="#orgheadline2">1.2.1. Number of Map And Reduce tasks required per job</a></li>
</ul>
</li>
<li><a href="#orgheadline6">1.3. Refinements</a>
<ul>
<li><a href="#orgheadline4">1.3.1. Combiners</a></li>
<li><a href="#orgheadline5">1.3.2. Partition Function</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">2. Week 1 Analysis of large graphs</a>
<ul>
<li><a href="#orgheadline15">2.1. Link Analysis and Page Rank</a>
<ul>
<li><a href="#orgheadline13">2.1.1. Mathematical Formulation for the Page Rank algorithm</a></li>
<li><a href="#orgheadline14">2.1.2. How do we really compute page rank in web-scale graphs??</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline27">3. Week 2 Similar Sets LSH</a>
<ul>
<li><a href="#orgheadline26">3.1. Finding Similar Sets</a>
<ul>
<li><a href="#orgheadline17">3.1.1. Shingling</a></li>
<li><a href="#orgheadline20">3.1.2. Minhashing</a></li>
<li><a href="#orgheadline21">3.1.3. LSH</a></li>
<li><a href="#orgheadline25">3.1.4. Applications of LSH</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline28">4. Week 2 K-Nearest neighbour learning</a></li>
<li><a href="#orgheadline41">5. Week 2 Frequent Itemsets</a>
<ul>
<li><a href="#orgheadline40">5.1. Market-Basket Model:</a>
<ul>
<li><a href="#orgheadline29">5.1.1. Introduction and applications</a></li>
<li><a href="#orgheadline30">5.1.2. Association rules</a></li>
<li><a href="#orgheadline31">5.1.3. finding association rules</a></li>
<li><a href="#orgheadline32">5.1.4. A-priori algorithm</a></li>
<li><a href="#orgheadline36">5.1.5. Improvements to A-priori</a></li>
<li><a href="#orgheadline39">5.1.6. All (or most) frequent itemsets in &lt;= 2 passes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline47">6. Week 3 Community Detection</a>
<ul>
<li><a href="#orgheadline43">6.1. Using Affiliation Graph Model and BIGCLAM</a>
<ul>
<li><a href="#orgheadline42">6.1.1. AGM to BIGCLAM</a></li>
</ul>
</li>
<li><a href="#orgheadline44">6.2. What makes a good cluster?</a></li>
<li><a href="#orgheadline46">6.3. Spectral Graph Partitioning</a>
<ul>
<li><a href="#orgheadline45">6.3.1. Spectral Graph partitioning</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline61">7. Week 3 Streams</a>
<ul>
<li><a href="#orgheadline60">7.1. The Stream Model</a>
<ul>
<li><a href="#orgheadline48">7.1.1. Stream management system.</a></li>
<li><a href="#orgheadline54">7.1.2. Sliding window</a></li>
<li><a href="#orgheadline55">7.1.3. Bloom filters</a></li>
<li><a href="#orgheadline56">7.1.4. Sampling streams</a></li>
<li><a href="#orgheadline59">7.1.5. Counting distinct elements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline73">8. Week 5 Clustering</a>
<ul>
<li><a href="#orgheadline65">8.1. Hierarchical clustering</a>
<ul>
<li><a href="#orgheadline62">8.1.1. Euclidean case</a></li>
<li><a href="#orgheadline63">8.1.2. Non-Euclidean case</a></li>
<li><a href="#orgheadline64">8.1.3. When to stop clustering?</a></li>
</ul>
</li>
<li><a href="#orgheadline66">8.2. K-Means algorithm</a></li>
<li><a href="#orgheadline72">8.3. Bradley-Fayed-Reina (BFR) algorithm</a>
<ul>
<li><a href="#orgheadline67">8.3.1. Assumptions:</a></li>
<li><a href="#orgheadline71">8.3.2. Algorithm</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline76">9. Week 7 LSH Improvements</a>
<ul>
<li><a href="#orgheadline75">9.1. LSH families of Hash functions</a>
<ul>
<li><a href="#orgheadline74">9.1.1. Random Hyperplane family for cosine distance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline77">10. Week 7 More about link analysis</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> Week 1 Map Reduce Paradigm</h2>
<div class="outline-text-2" id="text-1">
<p>
Whats so cool about this?
MapReduce paradigm emerged to make cluster computing easier (from a programming perspective).
The goal was to abstract out the various difficulties in cluster computing like:
Handling node failures, complexities of distributed computing.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> MapReduce Programming Model:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Map -&gt; Group by Key -&gt; Reduce 
</p>

<p>
Map Function: Takes the input and returns (key, val) pairs.
Group by Key: Combine same keys
Reduce: Do some transformation and return result for the (key, [v1 ,v2 &#x2026;]) group.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.2</span> Scheduling and Data Flow</h3>
<div class="outline-text-3" id="text-1-2">
<p>
MR system partitions the input data and stores them on multiple nodes.
Schedules the programs execution, and inter-node communications.
Files are redundantly chunked and stored on multiple nodes.
</p>

<p>
There is a masternode that has all the file metadata and takes care of the coordination.
Master is typically not replicated, so when it fails, the task is aborted.
</p>

<p>
<b>The input and final output</b> are stored in the dfs.
<b>intermediate results</b> are stored on the map/reduce worker nodes.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.2.1</span> Number of Map And Reduce tasks required per job</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
M map tasks, R reduce tasks.
Rule of thumb:
 M much larger than the number of nodes in the cluster.
 R is typically smaller than M.
The output is spread across the number of reducer nodes, fewer the better.
</p>

<p>
Multiple nodes do map and reduce tasks.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.3</span> Refinements</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.1</span> Combiners</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Between Mappers and Reducer.
To save network time, the combiner pre-aggregates/transforms values with same key before sending to reducer.
ex) In the wordcount example, if from the map task running on a single node, we get (foo, 1), (foo, 1).
The combiner on that node, will combine them to (foo, 2). And only this value is sent to the reducer.
</p>

<p>
Programmer provides the combinde function :: (K, V1) -&gt; V2
<b>Note</b> Combiner trick works only if the reduce fn is commutative and associative.
ex) sum fn can use the combiner trick,
    but average fn cannot. (because average fn is not commutative and associative) We can instead make the combiner send the total sum and number of values. The reducer can use this 
and compute the average.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.3.2</span> Partition Function</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
This is provided by the map reduce system.
However, sometimes its useful to override the default partition fn. (Check the hostname/url example in the slides)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">2</span> Week 1 Analysis of large graphs</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.1</span> Link Analysis and Page Rank</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We'll Analyze the webgraph as an example
Main idea:
Compute important scores for nodes in a graph.
These methods are called link analysis:
</p>
<ul class="org-ul">
<li>page rank</li>
<li>hubs and authorities (hits)</li>
<li>topic-specific (personalized) pagerank</li>
<li>web spam detection algorithms</li>
</ul>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">2.1.1</span> Mathematical Formulation for the Page Rank algorithm</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><ol class="org-ol"><li><a id="orgheadline8"></a>Flow formulation<br  /><div class="outline-text-5" id="text-2-1-1-1">
<p>
     Basic Idea:
Think of in-links as votes.
The in-link from a important page has higher weight than one from a less important page.
Recursive formulation!!
</p>

<p>
If page 'j' has importance r<sub>j</sub> and and 'n' out-links, 
</p>
<ul class="org-ul">
<li>weight of each out-link is r<sub>j</sub>/n</li>
</ul>

<p>
The rank r<sub>j</sub> for page j is
r<sub>j</sub> = &sum; r<sub>i</sub>/d<sub>i</sub> &forall; nodes i that point to j with rank r<sub>i</sub> and out-degree d<sub>i</sub>
</p>

<p>
Add an addition constraint &sum; r<sub>j</sub> &forall; j in graph to be 1. (This enforces uniqueness)
</p>

<p>
But this methods requires solving a bunch of equations. Guassian Elimination will work for small graphs, but not at the webscale!!
</p>
</div></li>

<li><a id="orgheadline9"></a>Matrix formulation<br  /><div class="outline-text-5" id="text-2-1-1-2">
<p>
The above formulation can be rewritten as a eigen-vector formulation.
</p>

<p>
If page i has d out-links
Matrix M<sub>ji</sub> = 1/d<sub>i</sub> where d<sub>i</sub> is the out-degree of node i.
</p>

<p>
The Matrix M is column stochastic as every column sums to one.
i.e) column i represents all the out-links from i. 
Thus the page rank formulation can be written as r = Mr.
Rank vector r is the eigen vector of the web-matrix M.
</p>

<p>
This can be efficiently computed using many methods. One such method is power-iteration.
</p>

<p>
Power Iteration:
</p>
<ul class="org-ul">
<li>Start with r<sub>0</sub> = [1/N, 1/N &#x2026;]<sup>T</sup></li>
</ul>
<p>
As there are N webpages.
</p>
<ul class="org-ul">
<li>r<sub>1</sub> = Mr<sub>0</sub></li>
<li>Keep Iterating unitl (r<sub>1</sub> - r<sub>0</sub>) &lt; &epsilon;</li>
<li>r<sub>1</sub> - r<sub>0</sub> is L1 norm, it can be any vector norm.</li>
</ul>
</div></li>
