mmds.org
**** Random Walk interpretation of Page Rank
Another way to think about page rank is using the idea of a random surfer.
If the random surfer is at a page 'i' at time t, what is the probability that he is in a page 'j'
at time t+1.
This is p_i(t)*(1/d_i)

Let p(t) be a vector that is the probability distribution at time 't' \forall nodes.
p(t+1) = Mp(t)

This is the same as the eigen value formulation above!!
When p(t+1) = Mp(t) = p(t), this is a stationary distribution.
Thus r is the stationary distribution for the random walk.

***** [[https://www.youtube.com/watch?v=uvYTGEZQTEs&list=PLANMHOrJaFxPMQCMYcYqwOCYlreFswAKP][Markov Processes]]
Central idea from the theory:
For graphs that satisfy certain conditions, the distribution will reach a stationary 
distribution irrespective of the initially probability distribution at t=0.

From the youtube videos linked above,
regular markov chain are the ones that have a stationary distribution.
regular markov chains are ones in which some power of the transition matrix has only
positive entries.
*absorbing states*
states of a transition matrix, in which it impossible to exit a state after entering it.


**** Google formulation of Page Rank
     we have our equation r_j^(t+1) =  Mr_j^t
Does this converge to what we want? is it reasonable?
It will converge if there are 
- no absorbing states (dead ends)
- no spider traps (small part of the graph which is not connected to anyother node,
 the surfer keeps jumping withing that part of the graph)

These 2 issues can be addressed by random-teleportation. 

Thus, in every iteration step:
- The surfer follows the links with p(\beta) and teleports to any random node with probability (1 - \beta).

Why does this make our power iteration converge?
 
From the markov chain theory, p_(t+1) = \pi * p_t
This will converge if \pi is
- Stochastic
- Aperiodic
- Irreducible (probability of going from one state in the graph to any other state is non-zero)
 
Adding random teleportation provides these conditions.

*** How do we really compute page rank in web-scale graphs??
    
    r_(t+1) = Ar_t
    
This would work great if we can store A in main memory.
Every entry in A will be non-negative, so this is going to takeup huuuuuuge amount of memory
boe:
- 1b webpages, 4 bytes per page (say)
  - r vectors will need 2 * 1b = 2billion entries.
  - matrix M will need 10^(9*2), wow!

Another way to formulate this:
- The matrix M is quite sparse.
- The random teleportation from a node j, adds (p(1-\beta)/N) in column j for every node in the graph, and reduces probability to (\beta)/N in column j of matrix M.
- i.e Tax each page (1-\beta) of its score, and distribute it evenly among all nodes.

r = A.r where A_(ij) = \beta M_(ij) + (1-\beta)/N

r_i = \sum_(j=1)^N A_(ij).r_j

A_(ij) = \sum_(j=1)^N (\beta M_(ij)*r_j + (1-\beta)/N * r_j)
A_(ij) = \beta \sum_(j=1)^N M_(ij)*r_j + (1-\beta)/N (as \sum_(j=)^N r_j = 1)

thus r = \beta M .r + (constant)
Thus, we can work with the sparse matrix M, and add a constant to every entry in each power iteration step.

Awesomatic Algorithm:
- while \sum_(j)(r_j^(t+1) - r_j^(t) > \epsilon) 
  - initialize r_j^0 = 1/N, t = 1
    - \forall j, r_j^(t) = \sum_(i->j)^N \beta * r_i^(t-1)/d_i
      - r_j^(t) = 0 if in-degre of j is 0
    - Re-insert the leaked page rank
    - \forall j: r_j^(t) = (1-S)/N where S = \sum_(j=1)^N r_j
    - t = t+1
      
* Week 2 Similar Sets LSH 
** Finding Similar Sets
   We'll focus on document similar in web-scale as an example.
   

   Its good to find similar sets, lot of cool applications like
recommendations, plagiarism, entity resolution.
3 essential techniques for similar documents:
1. Shingling
2. Minhashing
3. Locality Sensitive Hashing (LSH)

*** Shingling
    k-shingle for a document is a set of k characters that appears in that document.

Documents that are intuitively similar will have many shingles in common.
Shingles can be hashed to reduce storage bytes.

*** Minhashing
    This technique is used to uniquely represent each document by a vector.
The idea:
to start with, a *boolean matrix* is used to represent documents with various elements. (B)

Ex) rows = all possible K shingles.
    columns =  sets. (documents in our case)
- row e, col s has a 1 in it, only if element e belongs to set (document) s. 

Typically, this matrix is pretty sparse.

consider a set of minhash functions H.
Each fn:
- creates a random permutation of the rows, say r_p.
- h(c) = the first number n_p in r_p for which  B(n_p, c) = 1.
  
The Signature of the set (H(s)) is a vector with of numbers obtained from the various hash functions in H.
ex)
H = {h1, h2, h3, h4}
H(s) = [h1(c), h2(c), h3(c), h4(c)]

This is done for all columns to obtain the signature matrix S from the boolean matrix and H.

*Surprising property*
given 2 columns, c1 and c2, p(h(c1) = h(c2)) = Sim(c1, c2)

**** Similarity of signatures: /fraction of minhash fns for which h(c1) = h(c2)/
The expected value of Sos is the jaccard similarity of the 2 columns!!

**** Permuting the rows
Creating a permuted set of rows is expensive. For 1 billion rows, we'll need 1 billion entries
to store one permutation. 
Instead, here is a good approximation to permutation:
- Pick a set of normal hash fns. h1, h2, h3...
- Keep a slot M(i, c) for ith permutation and column c.
- M(i, c) will have the smallest value of h_i(r) for which row r has 1 in column c.
  
h_i corresponds to the ith permutation of the rows.

Algorithm:
- for each row r:
  - for each hash fn h:
    - compute h(r)

  - for each column c:

    - if B(r, c) is 1

      - for each hash fn h:

	- if h(r) < M(i, c)

	  - M(i, c) = h(r)








  



