mmds.html

<li><a id="orgheadline11"></a>Random Walk interpretation of Page Rank<br  /><div class="outline-text-5" id="text-2-1-1-3">
<p>
Another way to think about page rank is using the idea of a random surfer.
If the random surfer is at a page 'i' at time t, what is the probability that he is in a page 'j'
at time t+1.
This is p<sub>i</sub>(t)*(1/d<sub>i</sub>)
</p>

<p>
Let p(t) be a vector that is the probability distribution at time 't' &forall; nodes.
p(t+1) = Mp(t)
</p>

<p>
This is the same as the eigen value formulation above!!
When p(t+1) = Mp(t) = p(t), this is a stationary distribution.
Thus r is the stationary distribution for the random walk.
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline10"></a><a href="https://www.youtube.com/watch?v=uvYTGEZQTEs&amp;list=PLANMHOrJaFxPMQCMYcYqwOCYlreFswAKP">Markov Processes</a><br  /><div class="outline-text-6" id="text-2-1-1-3-1">
<p>
Central idea from the theory:
For graphs that satisfy certain conditions, the distribution will reach a stationary 
distribution irrespective of the initially probability distribution at t=0.
</p>

<p>
From the youtube videos linked above,
regular markov chain are the ones that have a stationary distribution.
regular markov chains are ones in which some power of the transition matrix has only
positive entries.
<b>absorbing states</b>
states of a transition matrix, in which it impossible to exit a state after entering it.
</p>
</div></li></ol></li>


<li><a id="orgheadline12"></a>Google formulation of Page Rank<br  /><div class="outline-text-5" id="text-2-1-1-4">
<p>
     we have our equation r<sub>j</sub><sup>(t+1)</sup> =  Mr<sub>j</sub><sup>t</sup>
Does this converge to what we want? is it reasonable?
It will converge if there are 
</p>
<ul class="org-ul">
<li>no absorbing states (dead ends)</li>
<li>no spider traps (small part of the graph which is not connected to anyother node,
the surfer keeps jumping withing that part of the graph)</li>
</ul>

<p>
These 2 issues can be addressed by random-teleportation. 
</p>

<p>
Thus, in every iteration step:
</p>
<ul class="org-ul">
<li>The surfer follows the links with p(&beta;) and teleports to any random node with probability (1 - &beta;).</li>
</ul>

<p>
Why does this make our power iteration converge?
</p>

<p>
From the markov chain theory, p<sub>(t+1)</sub> = &pi; * p<sub>t</sub>
This will converge if &pi; is
</p>
<ul class="org-ul">
<li>Stochastic</li>
<li>Aperiodic</li>
<li>Irreducible (probability of going from one state in the graph to any other state is non-zero)</li>
</ul>

<p>
Adding random teleportation provides these conditions.
</p>
</div></li></ol>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">2.1.2</span> How do we really compute page rank in web-scale graphs??</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
r<sub>(t+1)</sub> = Ar<sub>t</sub>
</p>

<p>
This would work great if we can store A in main memory.
Every entry in A will be non-negative, so this is going to takeup huuuuuuge amount of memory
boe:
</p>
<ul class="org-ul">
<li>1b webpages, 4 bytes per page (say)
<ul class="org-ul">
<li>r vectors will need 2 * 1b = 2billion entries.</li>
<li>matrix M will need 10<sup>(9*2)</sup>, wow!</li>
</ul></li>
</ul>

<p>
Another way to formulate this:
</p>
<ul class="org-ul">
<li>The matrix M is quite sparse.</li>
<li>The random teleportation from a node j, adds (p(1-&beta;)/N) in column j for every node in the graph, and reduces probability to (&beta;)/N in column j of matrix M.</li>
<li>i.e Tax each page (1-&beta;) of its score, and distribute it evenly among all nodes.</li>
</ul>

<p>
r = A.r where A<sub>(ij)</sub> = &beta; M<sub>(ij)</sub> + (1-&beta;)/N
</p>

<p>
r<sub>i</sub> = &sum;<sub>(j=1)</sub><sup>N</sup> A<sub>(ij)</sub>.r<sub>j</sub>
</p>

<p>
A<sub>(ij)</sub> = &sum;<sub>(j=1)</sub><sup>N</sup> (&beta; M<sub>(ij)</sub>*r<sub>j</sub> + (1-&beta;)/N * r<sub>j</sub>)
A<sub>(ij)</sub> = &beta; &sum;<sub>(j=1)</sub><sup>N</sup> M<sub>(ij)</sub>*r<sub>j</sub> + (1-&beta;)/N (as &sum;<sub>(j=)</sub><sup>N</sup> r<sub>j</sub> = 1)
</p>

<p>
thus r = &beta; M .r + (constant)
Thus, we can work with the sparse matrix M, and add a constant to every entry in each power iteration step.
</p>

<p>
Awesomatic Algorithm:
</p>
<ul class="org-ul">
<li>while &sum;<sub>(j)</sub>(r<sub>j</sub><sup>(t+1)</sup> - r<sub>j</sub><sup>(t)</sup> &gt; &epsilon;) 
<ul class="org-ul">
<li>initialize r<sub>j</sub><sup>0</sup> = 1/N, t = 1
<ul class="org-ul">
<li>&forall; j, r<sub>j</sub><sup>(t)</sup> = &sum;<sub>(i-&gt;j)</sub><sup>N</sup> &beta; * r<sub>i</sub><sup>(t-1)</sup>/d<sub>i</sub>
<ul class="org-ul">
<li>r<sub>j</sub><sup>(t)</sup> = 0 if in-degre of j is 0</li>
</ul></li>
<li>Re-insert the leaked page rank</li>
<li>&forall; j: r<sub>j</sub><sup>(t)</sup> = (1-S)/N where S = &sum;<sub>(j=1)</sub><sup>N</sup> r<sub>j</sub></li>
<li>t = t+1</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">3</span> Week 2 Similar Sets LSH</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">3.1</span> Finding Similar Sets</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We'll focus on document similar in web-scale as an example.
</p>


<p>
   Its good to find similar sets, lot of cool applications like
recommendations, plagiarism, entity resolution.
3 essential techniques for similar documents:
</p>
<ol class="org-ol">
<li>Shingling</li>
<li>Minhashing</li>
<li>Locality Sensitive Hashing (LSH)</li>
</ol>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">3.1.1</span> Shingling</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
k-shingle for a document is a set of k characters that appears in that document.
</p>

<p>
Documents that are intuitively similar will have many shingles in common.
Shingles can be hashed to reduce storage bytes.
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">3.1.2</span> Minhashing</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
    This technique is used to uniquely represent each document by a vector.
The idea:
to start with, a <b>boolean matrix</b> is used to represent documents with various elements. (B)
</p>

<p>
Ex) rows = all possible K shingles.
    columns =  sets. (documents in our case)
</p>
<ul class="org-ul">
<li>row e, col s has a 1 in it, only if element e belongs to set (document) s.</li>
</ul>

<p>
Typically, this matrix is pretty sparse.
</p>

<p>
consider a set of minhash functions H.
Each fn:
</p>
<ul class="org-ul">
<li>creates a random permutation of the rows, say r<sub>p</sub>.</li>
<li>h(c) = the first number n<sub>p</sub> in r<sub>p</sub> for which  B(n<sub>p</sub>, c) = 1.</li>
</ul>

<p>
The Signature of the set (H(s)) is a vector with of numbers obtained from the various hash functions in H.
ex)
H = {h1, h2, h3, h4}
H(s) = [h1(c), h2(c), h3(c), h4(c)]
</p>

<p>
This is done for all columns to obtain the signature matrix S from the boolean matrix and H.
</p>

<p>
<b>Surprising property</b>
given 2 columns, c1 and c2, p(h(c1) = h(c2)) = Sim(c1, c2)
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline18"></a>Similarity of signatures: <i>fraction of minhash fns for which h(c1) = h(c2)</i><br  /><div class="outline-text-5" id="text-3-1-2-1">
<p>
The expected value of Sos is the jaccard similarity of the 2 columns!!
</p>
</div></li>

<li><a id="orgheadline19"></a>Permuting the rows<br  /><div class="outline-text-5" id="text-3-1-2-2">
<p>
Creating a permuted set of rows is expensive. For 1 billion rows, we'll need 1 billion entries
to store one permutation. 
Instead, here is a good approximation to permutation:
</p>
<ul class="org-ul">
<li>Pick a set of normal hash fns. h1, h2, h3&#x2026;</li>
<li>Keep a slot M(i, c) for ith permutation and column c.</li>
<li>M(i, c) will have the smallest value of h<sub>i</sub>(r) for which row r has 1 in column c.</li>
</ul>

<p>
h<sub>i</sub> corresponds to the ith permutation of the rows.
</p>

<p>
Algorithm:
</p>
<ul class="org-ul">
<li>for each row r:
<ul class="org-ul">
<li>for each hash fn h:
<ul class="org-ul">
<li>compute h(r)</li>
</ul></li>

<li>for each column c:

<ul class="org-ul">
<li>if B(r, c) is 1

<ul class="org-ul">
<li>for each hash fn h:

<ul class="org-ul">
<li>if h(r) &lt; M(i, c)

<ul class="org-ul">
<li>M(i, c) = h(r)</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div></li></ol>
</div>
