mmds.org
*** LSH
    Basic idea:
Rather than comparing all pairs of elements (docs), compare only the ones that have a
decent chance of being similar. (called *candidate pairs*)

in our case,
- pick a similarity threshold t, compare only those pairs that have a similarity greater than t.

How?
hash each doc to multiple buckets. Compare only those documents that are in the same bucket.

- Divide matrix M (Signature matrix) into b bands with r rows each.
- apply a hash fn to each band.
- Candidate pairs are those which fall in the same bucket for atleast one of the b bands.
- tune b and r to catch most similar pairs, but few nonsimiliar pairs.
  Intuitively,
larger b, smaller r is good if low similarity threshold
small b, large r is good if high similarity threshold

Look at the slides, to understand the math, but the relation is

   1 - (1 - s^r)^b
   t = (1/b)^(1/r)

This is a step function. We can tune b and r, based on the desired 't'. 

*** Applications of LSH
    
**** Entity Resolution
     misspellings, nicknames, change of address, phone numbers make entity resolution pretty interesting.
     Pretty cool application explained, in which jeff helped find similar records for 2 companies.
     
**** Fingerprint matching
     This again uses lsh, the nice trick in this one is the bucketing technique.
1024 sets of randomly selected 3 grid squares are taken from 2 fingerprints and compared.
If they match in any one of these sets, then they are compared. See the lectures as to why the 
numbers workout.

**** Duplicate news articles
     This uses a nice shingling technique. Stop words are used to get shingles. Idea is
similar articles will have common shingles, since ads dont have many stopwords. but
articles do.

* Week 2 K-Nearest neighbour learning
Supervised learning technique. y = f(x). predict y, for given features vector x.
Instance based learning: Keep whole training set. for a new query q, look at all x^' near q
and use that to predict y_q for q.
Collaborative filtering is a good example of k-NN finder.

Basic idea: /*Look at the K nearest nieghbours of our query point, and just predict the
avg output*/

Instead of looking at all points, to pick the nearest neighbors, just look at k-points 
near the query fn. how do you look at only a few points to figure out the k? LSH!!!
* Week 2 Frequent Itemsets
  Frequent Itemsets are items that appear together.
** Market-Basket Model:
*** Introduction and applications

Baskets, Items: stuff that are in a basket.
/*support*/ number of baskets that contain the same set of items.
/*support threshold*/ threshold number over which items are considered
 as /*frequent itemsets*/.

Applications examples:
baskets: sets of products, items: products
b: sentences, i: documents (plagiarism)
b: docs i: words (similar tweets/ other small docs)

Note: For good performance, there should be few items in a basket. (usually *quadratic in items* work done per basket)
*** Association rules

If a basket contains {i_1, i_2...i_k} -> j, it implies it likely contains j.
The degree of truth in this rule is the *confidence* of this rule. 
fraction of baskets that contain all of i_1-i_k and j vs those with i_1-i_k without j. i.e)  {i_1, i_2...i_k, j}/{i_1, i_2, ...i_k}

/*Support of an association rule is the support of the items on the left of arrow*/
*** finding association rules

question: /*Find all association rules, with support >= s and confidence >= c.*/

- find all frequent itemsets with support >= cs
- find all frequent itemsets with support >= s
- now, {i_1, i_2..i_k, i_(k+1)}, pick all subsets of this list with k items.
- if the support of {i_1, i_2 ... i_k} is s1 ~ >= s, then {i_1, i_2 ... i_k, i_(k+1)} is
a set with support s2 ~ cs. then the confidence of the association rule {i_1, ...i_k} -> j
is atleast c.
*** A-priori algorithm
2 pass algorithm for finding frequent itemsets.
main idea: If item i does not appear in s baskets, then no pair including i can appear
in s baskets.
algorithm:
2 pass algorithm
- in first pass, read all items and calculate count for each item. (i.e number of baskets in 
which the item appears)
- eliminate all items that have support < s.
- in second pass, read all pairs of items and its count.
- eliminate items that have support < s.
*** Improvements to A-priori
**** Part-Chen-Yu-Algorithm
     - In the first pass of a-priori, hash each pair to a bucket and keep (bucket, count) pairs
in memory.
     - In pass two, also check if the pair hashes to a bucket with count > support
**** Multistage algorithm
     - Add one more pass. create a middle pass that rehashes all the pairs (using diff hash fn)
in the first pass whose bucket counts were > s.
**** Multihash
     -  like pcy, but use multiple hashes in stage 1.

*** All (or most) frequent itemsets in <= 2 passes
    
**** SON algorithm
- pick random subset of all baskets that fit in memory.
- use a scaled back support s.
- do this multiple times for multiple random subsets.
- candidate pairs for second pass are those that satisfy the support in any one of the random subsets.
**** Toivonens algorithm 
- pick random subset of all baskets that fit in memory.
- use a scaled back support s. Further, the scaled back threshold is reduced slightly.
- Add to the itemsets obtained, the /*negative border*/ of these itemsets.
*negative border*
An itemset is in the negative border, if it is not deemed frequent in the sample,
but all its subsets are.

- run pass 2 which finds the frequent itemsets from all the data.
- If an itemset is in the negative border, and it turns out to be frequent, then we must 
start over again with another sample.

* Week 3 Community Detection
  Detect communities in a huge ass graph.
