mmds.html












<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">3.1.3</span> LSH</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
    Basic idea:
Rather than comparing all pairs of elements (docs), compare only the ones that have a
decent chance of being similar. (called <b>candidate pairs</b>)
</p>

<p>
in our case,
</p>
<ul class="org-ul">
<li>pick a similarity threshold t, compare only those pairs that have a similarity greater than t.</li>
</ul>

<p>
How?
hash each doc to multiple buckets. Compare only those documents that are in the same bucket.
</p>

<ul class="org-ul">
<li>Divide matrix M (Signature matrix) into b bands with r rows each.</li>
<li>apply a hash fn to each band.</li>
<li>Candidate pairs are those which fall in the same bucket for atleast one of the b bands.</li>
<li>tune b and r to catch most similar pairs, but few nonsimiliar pairs.
Intuitively,</li>
</ul>
<p>
larger b, smaller r is good if low similarity threshold
small b, large r is good if high similarity threshold
</p>

<p>
Look at the slides, to understand the math, but the relation is
</p>

<p>
1 - (1 - s<sup>r</sup>)<sup>b</sup>
t = (1/b)<sup>(1/r)</sup>
</p>

<p>
This is a step function. We can tune b and r, based on the desired 't'. 
</p>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">3.1.4</span> Applications of LSH</h4>
<div class="outline-text-4" id="text-3-1-4">
</div><ol class="org-ol"><li><a id="orgheadline22"></a>Entity Resolution<br  /><div class="outline-text-5" id="text-3-1-4-1">
<p>
misspellings, nicknames, change of address, phone numbers make entity resolution pretty interesting.
Pretty cool application explained, in which jeff helped find similar records for 2 companies.
</p>
</div></li>

<li><a id="orgheadline23"></a>Fingerprint matching<br  /><div class="outline-text-5" id="text-3-1-4-2">
<p>
     This again uses lsh, the nice trick in this one is the bucketing technique.
1024 sets of randomly selected 3 grid squares are taken from 2 fingerprints and compared.
If they match in any one of these sets, then they are compared. See the lectures as to why the 
numbers workout.
</p>
</div></li>

<li><a id="orgheadline24"></a>Duplicate news articles<br  /><div class="outline-text-5" id="text-3-1-4-3">
<p>
     This uses a nice shingling technique. Stop words are used to get shingles. Idea is
similar articles will have common shingles, since ads dont have many stopwords. but
articles do.
</p>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">4</span> Week 2 K-Nearest neighbour learning</h2>
<div class="outline-text-2" id="text-4">
<p>
Supervised learning technique. y = f(x). predict y, for given features vector x.
Instance based learning: Keep whole training set. for a new query q, look at all x^' near q
and use that to predict y<sub>q</sub> for q.
Collaborative filtering is a good example of k-NN finder.
</p>

<p>
Basic idea: <i><b>Look at the K nearest nieghbours of our query point, and just predict the
avg output</b></i>
</p>

<p>
Instead of looking at all points, to pick the nearest neighbors, just look at k-points 
near the query fn. how do you look at only a few points to figure out the k? LSH!!!
</p>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-2">
<h2 id="orgheadline41"><span class="section-number-2">5</span> Week 2 Frequent Itemsets</h2>
<div class="outline-text-2" id="text-5">
<p>
Frequent Itemsets are items that appear together.
</p>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">5.1</span> Market-Basket Model:</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">5.1.1</span> Introduction and applications</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Baskets, Items: stuff that are in a basket.
<i><b>support</b></i> number of baskets that contain the same set of items.
<i><b>support threshold</b></i> threshold number over which items are considered
 as <i><b>frequent itemsets</b></i>.
</p>

<p>
Applications examples:
baskets: sets of products, items: products
b: sentences, i: documents (plagiarism)
b: docs i: words (similar tweets/ other small docs)
</p>

<p>
Note: For good performance, there should be few items in a basket. (usually <b>quadratic in items</b> work done per basket)
</p>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">5.1.2</span> Association rules</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
If a basket contains {i<sub>1</sub>, i<sub>2&#x2026;i</sub><sub>k</sub>} -&gt; j, it implies it likely contains j.
The degree of truth in this rule is the <b>confidence</b> of this rule. 
fraction of baskets that contain all of i<sub>1</sub>-i<sub>k</sub> and j vs those with i<sub>1</sub>-i<sub>k</sub> without j. i.e)  {i<sub>1</sub>, i<sub>2&#x2026;i</sub><sub>k</sub>, j}/{i<sub>1</sub>, i<sub>2</sub>, &#x2026;i<sub>k</sub>}
</p>

<p>
<i><b>Support of an association rule is the support of the items on the left of arrow</b></i>
</p>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">5.1.3</span> finding association rules</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
question: <i><b>Find all association rules, with support &gt;= s and confidence &gt;= c.</b></i>
</p>

<ul class="org-ul">
<li>find all frequent itemsets with support &gt;= cs</li>
<li>find all frequent itemsets with support &gt;= s</li>
<li>now, {i<sub>1</sub>, i<sub>2..i</sub><sub>k</sub>, i<sub>(k+1)</sub>}, pick all subsets of this list with k items.</li>
<li>if the support of {i<sub>1</sub>, i<sub>2</sub> &#x2026; i<sub>k</sub>} is s1 ~ &gt;= s, then {i<sub>1</sub>, i<sub>2</sub> &#x2026; i<sub>k</sub>, i<sub>(k+1)</sub>} is</li>
</ul>
<p>
a set with support s2 ~ cs. then the confidence of the association rule {i<sub>1</sub>, &#x2026;i<sub>k</sub>} -&gt; j
is atleast c.
</p>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">5.1.4</span> A-priori algorithm</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
2 pass algorithm for finding frequent itemsets.
main idea: If item i does not appear in s baskets, then no pair including i can appear
in s baskets.
algorithm:
2 pass algorithm
</p>
<ul class="org-ul">
<li>in first pass, read all items and calculate count for each item. (i.e number of baskets in</li>
</ul>
<p>
which the item appears)
</p>
<ul class="org-ul">
<li>eliminate all items that have support &lt; s.</li>
<li>in second pass, read all pairs of items and its count.</li>
<li>eliminate items that have support &lt; s.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">5.1.5</span> Improvements to A-priori</h4>
<div class="outline-text-4" id="text-5-1-5">
</div><ol class="org-ol"><li><a id="orgheadline33"></a>Part-Chen-Yu-Algorithm<br  /><div class="outline-text-5" id="text-5-1-5-1">
<ul class="org-ul">
<li>In the first pass of a-priori, hash each pair to a bucket and keep (bucket, count) pairs</li>
</ul>
<p>
in memory.
</p>
<ul class="org-ul">
<li>In pass two, also check if the pair hashes to a bucket with count &gt; support</li>
</ul>
</div></li>
<li><a id="orgheadline34"></a>Multistage algorithm<br  /><div class="outline-text-5" id="text-5-1-5-2">
<ul class="org-ul">
<li>Add one more pass. create a middle pass that rehashes all the pairs (using diff hash fn)</li>
</ul>
<p>
in the first pass whose bucket counts were &gt; s.
</p>
</div></li>
<li><a id="orgheadline35"></a>Multihash<br  /><div class="outline-text-5" id="text-5-1-5-3">
<ul class="org-ul">
<li>like pcy, but use multiple hashes in stage 1.</li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">5.1.6</span> All (or most) frequent itemsets in &lt;= 2 passes</h4>
<div class="outline-text-4" id="text-5-1-6">
</div><ol class="org-ol"><li><a id="orgheadline37"></a>SON algorithm<br  /><div class="outline-text-5" id="text-5-1-6-1">
<ul class="org-ul">
<li>pick random subset of all baskets that fit in memory.</li>
<li>use a scaled back support s.</li>
<li>do this multiple times for multiple random subsets.</li>
<li>candidate pairs for second pass are those that satisfy the support in any one of the random subsets.</li>
</ul>
</div></li>
<li><a id="orgheadline38"></a>Toivonens algorithm<br  /><div class="outline-text-5" id="text-5-1-6-2">
<ul class="org-ul">
<li>pick random subset of all baskets that fit in memory.</li>
<li>use a scaled back support s. Further, the scaled back threshold is reduced slightly.</li>
<li>Add to the itemsets obtained, the <i><b>negative border</b></i> of these itemsets.</li>
</ul>
<p>
<b>negative border</b>
An itemset is in the negative border, if it is not deemed frequent in the sample,
but all its subsets are.
</p>

<ul class="org-ul">
<li>run pass 2 which finds the frequent itemsets from all the data.</li>
<li>If an itemset is in the negative border, and it turns out to be frequent, then we must</li>
</ul>
<p>
start over again with another sample.
</p>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline47" class="outline-2">
<h2 id="orgheadline47"><span class="section-number-2">6</span> Week 3 Community Detection</h2>
<div class="outline-text-2" id="text-6">
<p>
Detect communities in a huge ass graph.
</p>
</div>
