mmds.org
** Using Affiliation Graph Model and BIGCLAM
     Generative model for networkds
   c \in C, set of communities.
   v \in N, set of nodes.
   m \in M, memebership probabilities between n and c.
   AGM(V, C, M, {p_c})
   for each pair of nodes \in c, p_c is the probability that they are connected.
   P(u, v) = 1 - \pi_(c \in (M_u \cap M_v))(1 - p_c)
   for a pair of nodes u, v.
   This model helps us generate a network.
*** AGM to BIGCLAM
   Relax the agm model, each membership between node u and community a will have a strength F_ua.
   Each community A links nodes independently
P_A(u, v) = 1 - exp(-F_ua.F_va)
F = community membership strength matrix.
We have to find this matrix. (check slides for details)
** What makes a good cluster?
   Divide vertices into sets such that there are very few cross cluster connections
and lot of within cluster connections.
   - Use the idea of graph cuts to minimize this.
   - Will fail on some degenerate cases. (see slides)
   *Conductance*
\phi(A) = CUT(A)/Vol(A) 
Vol(A) = \sum_(i \in A)d_i. Lower the conductance, the better.
** Spectral Graph Partitioning
   Find clusters/communities in networks.
partition graph into pieces such that they have low conductance.
A: adjacency matrix of all nodes (n). (1 if connected, else 0)
x: vector of all nodes. (think of it as label/value of all nodes) 
what is A.x = y ??

y_i = A_i.x = \sum_(j = 1 to n) A_ij.x_j = \sum_(i, j \in E)x_ij
i.e y_i sum of all neighbours of i.

A.x = \lambda.x
Spetral Graph Theory:
Analyze the "spectrum" of matrix representing G.
spectrum: eigenvectors x_i of a graph, ordered by the magnitude of their
corresponding eigen values \lambda_i. \Lambda = {\lambda_1, \lambda_2 ... \lambda_n} \lambda_1 \le \lambda_2 ...

Graph Laplacian:
A: adjacency matrix.
D: degree matrix. it is a diagonal matrix of all degrees of nodes n.
Graph Laplacian Matrix L = D - A
n * n symmetrix matrix.
*** Spectral Graph partitioning
Fact:
For symmetric matrix M, second smallest eigen value is
\lambda_2 = min_x x^t(M)x / x^t.x

* Week 3 Streams
  Stream management is differenet from data management (from databases) in many ways.
  The input rate cannot be controlled, dont have all the time to do some computation.
** The Stream Model
   Two forms of quries:
   - /Standing queries/ 
queries asked all the time.
ex) output each new max value ever seen by the stream.

   - /Adhoc queries/
     One time queries.
ex) what is the max value seen so far in the stream.
*** Stream management system.
Consists of
Processor - (like esper) that allows for adhoc queries and standing queries.
Archival storage - not a dbms system, just stores the stream values so that the stream can be
reproduced in the future.
Limited working storage - (like flash/memory) that stores essential parts of the input stream
in a way that supports fast querying. 
*** Sliding window
    Useful model of stream processing in which queries are about stuff in a window.
    ex) averages. (avg of elements in the window)
    /Interesting case/: when the window cannot be stored in memory.
**** Counting 1's (when N does not fit in memory)
     Count the number of 1s for any k < N.
***** Algorithm that doesn't quite work:
       - Create blocks of 2, 4, 8, 16 ... upto log_2(N) looking backwards.
       - drop smaller blocks, if they begin at same point as a larger block,
or a larger block begins to its right.
       - Each block has the count of 1s in it.

****** Whats good in this algorithm?
       - O(log^2 N) bits.
	 - stores only O(log N) counts of log_2(N) bits each.
       - Easy updates as new bits come in. (we only have to modify O(log N) blocks)
       - Error in count no greater than number of 1's in the 'unknown area'.(some part of the last block)
******  Whats not good?
       - If all the ones are in the 'unknown area', error is unbounded.

***** DGIM method (rajeev motwani was one of them)
       Whats different in this?
 instead of creating exponential blocks based on the number of bits,
 do it based on the number of 1s seen in that block. i.e) block with 2 1s, block with 4 1s, 8 1s, 16 1s etc
*Bucket* it is a record that consists of:
- largest timestamp of the 1s in the bucket.
- number of ones between its beginning and end. (log log N) bits.
- constraint on buckets: number of 1s must be a power of 2, hence O(log log N) bits above. (i.e log N will be the number of ones, but instead of storing (log N) itself, we can store its log)
  
Look at slides for algorithm.
  
*** Bloom filters
   - filter streams only if the stream item is in someother list of items.
   - array of bits, set of independent hash fns.
   - when new input arrives in stream, pass it through the set of hash fns and set to 1 the
   array index returned by each of the hash fns. 
   - thus, the input has been seen if all these bits contain a one. (when querying)
*** Sampling streams
     - sample by value, not by position in stream.
ex) hash stream values to bunch of buckets. pick a few for the sample. (all/none of a stream value
is picked in the sample)
*** Counting distinct elements
    count all distinct elements in a stream.
    obvious algorithm: maintain set of elements in memory, and check for every new element
if it has been seen before.
**** flajolet-martin algorithm
     This algorithm is used to estimate the distinct elements in a stream.
     non-trivial idea:
use a hash fn that hashes every stream element to atleast (log_2 N) bits.
let r(a) = trailing 0s in h(a).
R = maximum r(a) over all a \in N.
estimate = 2^R. 
**** AMS method.
     Used for finding any moment, gives unbiased estimate.
     Based on multiple random variables.

* Week 5 Clustering 
** Hierarchical clustering
   Repeatedly combine two nearest clusters.
Start at each point as a cluster.
Notion of near? 
