mmds.html
<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">6.1</span> Using Affiliation Graph Model and BIGCLAM</h3>
<div class="outline-text-3" id="text-6-1">
<p>
  Generative model for networkds
c &isin; C, set of communities.
v &isin; N, set of nodes.
m &isin; M, memebership probabilities between n and c.
AGM(V, C, M, {p<sub>c</sub>})
for each pair of nodes &isin; c, p<sub>c</sub> is the probability that they are connected.
P(u, v) = 1 - &pi;<sub>(c &isin; (M<sub>u</sub> &cap; M<sub>v</sub>))</sub>(1 - p<sub>c</sub>)
for a pair of nodes u, v.
This model helps us generate a network.
</p>
</div>
<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">6.1.1</span> AGM to BIGCLAM</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
   Relax the agm model, each membership between node u and community a will have a strength F<sub>ua</sub>.
   Each community A links nodes independently
P<sub>A</sub>(u, v) = 1 - exp(-F<sub>ua.F</sub><sub>va</sub>)
F = community membership strength matrix.
We have to find this matrix. (check slides for details)
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">6.2</span> What makes a good cluster?</h3>
<div class="outline-text-3" id="text-6-2">
<p>
   Divide vertices into sets such that there are very few cross cluster connections
and lot of within cluster connections.
</p>
<ul class="org-ul">
<li>Use the idea of graph cuts to minimize this.</li>
<li>Will fail on some degenerate cases. (see slides)</li>
</ul>
<p>
   <b>Conductance</b>
&phi;(A) = CUT(A)/Vol(A) 
Vol(A) = &sum;<sub>(i &isin; A)</sub>d<sub>i</sub>. Lower the conductance, the better.
</p>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">6.3</span> Spectral Graph Partitioning</h3>
<div class="outline-text-3" id="text-6-3">
<p>
   Find clusters/communities in networks.
partition graph into pieces such that they have low conductance.
A: adjacency matrix of all nodes (n). (1 if connected, else 0)
x: vector of all nodes. (think of it as label/value of all nodes) 
what is A.x = y ??
</p>

<p>
y<sub>i</sub> = A<sub>i.x</sub> = &sum;<sub>(j = 1 to n)</sub> A<sub>ij.x</sub><sub>j</sub> = &sum;<sub>(i, j &isin; E)</sub>x<sub>ij</sub>
i.e y<sub>i</sub> sum of all neighbours of i.
</p>

<p>
A.x = &lambda;.x
Spetral Graph Theory:
Analyze the "spectrum" of matrix representing G.
spectrum: eigenvectors x<sub>i</sub> of a graph, ordered by the magnitude of their
corresponding eigen values &lambda;<sub>i</sub>. &Lambda; = {&lambda;<sub>1</sub>, &lambda;<sub>2</sub> &#x2026; &lambda;<sub>n</sub>} &lambda;<sub>1</sub> &le; &lambda;<sub>2</sub> &#x2026;
</p>

<p>
Graph Laplacian:
A: adjacency matrix.
D: degree matrix. it is a diagonal matrix of all degrees of nodes n.
Graph Laplacian Matrix L = D - A
n * n symmetrix matrix.
</p>
</div>
<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">6.3.1</span> Spectral Graph partitioning</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
Fact:
For symmetric matrix M, second smallest eigen value is
&lambda;<sub>2</sub> = min<sub>x</sub> x<sup>t</sup>(M)x / x<sup>t.x</sup>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline61" class="outline-2">
<h2 id="orgheadline61"><span class="section-number-2">7</span> Week 3 Streams</h2>
<div class="outline-text-2" id="text-7">
<p>
Stream management is differenet from data management (from databases) in many ways.
The input rate cannot be controlled, dont have all the time to do some computation.
</p>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">7.1</span> The Stream Model</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Two forms of quries:
</p>
<ul class="org-ul">
<li><i>Standing queries</i></li>
</ul>
<p>
queries asked all the time.
ex) output each new max value ever seen by the stream.
</p>

<ul class="org-ul">
<li><i>Adhoc queries</i>
     One time queries.</li>
</ul>
<p>
ex) what is the max value seen so far in the stream.
</p>
</div>
<div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">7.1.1</span> Stream management system.</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Consists of
Processor - (like esper) that allows for adhoc queries and standing queries.
Archival storage - not a dbms system, just stores the stream values so that the stream can be
reproduced in the future.
Limited working storage - (like flash/memory) that stores essential parts of the input stream
in a way that supports fast querying. 
</p>
</div>
</div>
<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="section-number-4">7.1.2</span> Sliding window</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
Useful model of stream processing in which queries are about stuff in a window.
ex) averages. (avg of elements in the window)
<i>Interesting case</i>: when the window cannot be stored in memory.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline53"></a>Counting 1's (when N does not fit in memory)<br  /><div class="outline-text-5" id="text-7-1-2-1">
<p>
Count the number of 1s for any k &lt; N.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline51"></a>Algorithm that doesn't quite work:<br  /><div class="outline-text-6" id="text-7-1-2-1-1">
<ul class="org-ul">
<li>Create blocks of 2, 4, 8, 16 &#x2026; upto log<sub>2</sub>(N) looking backwards.</li>
<li>drop smaller blocks, if they begin at same point as a larger block,</li>
</ul>
<p>
or a larger block begins to its right.
</p>
<ul class="org-ul">
<li>Each block has the count of 1s in it.</li>
</ul>
</div>

<ol class="org-ol"><li><a id="orgheadline49"></a>Whats good in this algorithm?<br  /><div class="outline-text-7" id="text-7-1-2-1-1-1">
<ul class="org-ul">
<li>O(log<sup>2</sup> N) bits.
<ul class="org-ul">
<li>stores only O(log N) counts of log<sub>2</sub>(N) bits each.</li>
</ul></li>
<li>Easy updates as new bits come in. (we only have to modify O(log N) blocks)</li>
<li>Error in count no greater than number of 1's in the 'unknown area'.(some part of the last block)</li>
</ul>
</div></li>
<li><a id="orgheadline50"></a>Whats not good?<br  /><div class="outline-text-7" id="text-7-1-2-1-1-2">
<ul class="org-ul">
<li>If all the ones are in the 'unknown area', error is unbounded.</li>
</ul>
</div></li></ol></li>

<li><a id="orgheadline52"></a>DGIM method (rajeev motwani was one of them)<br  /><div class="outline-text-6" id="text-7-1-2-1-2">
<p>
      Whats different in this?
instead of creating exponential blocks based on the number of bits,
do it based on the number of 1s seen in that block. i.e) block with 2 1s, block with 4 1s, 8 1s, 16 1s etc
<b>Bucket</b> it is a record that consists of:
</p>
<ul class="org-ul">
<li>largest timestamp of the 1s in the bucket.</li>
<li>number of ones between its beginning and end. (log log N) bits.</li>
<li>constraint on buckets: number of 1s must be a power of 2, hence O(log log N) bits above. (i.e log N will be the number of ones, but instead of storing (log N) itself, we can store its log)</li>
</ul>

<p>
Look at slides for algorithm.
</p>
</div></li></ol></li></ol>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">7.1.3</span> Bloom filters</h4>
<div class="outline-text-4" id="text-7-1-3">
<ul class="org-ul">
<li>filter streams only if the stream item is in someother list of items.</li>
<li>array of bits, set of independent hash fns.</li>
<li>when new input arrives in stream, pass it through the set of hash fns and set to 1 the</li>
</ul>
<p>
array index returned by each of the hash fns. 
</p>
<ul class="org-ul">
<li>thus, the input has been seen if all these bits contain a one. (when querying)</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="section-number-4">7.1.4</span> Sampling streams</h4>
<div class="outline-text-4" id="text-7-1-4">
<ul class="org-ul">
<li>sample by value, not by position in stream.</li>
</ul>
<p>
ex) hash stream values to bunch of buckets. pick a few for the sample. (all/none of a stream value
is picked in the sample)
</p>
</div>
</div>
<div id="outline-container-orgheadline59" class="outline-4">
<h4 id="orgheadline59"><span class="section-number-4">7.1.5</span> Counting distinct elements</h4>
<div class="outline-text-4" id="text-7-1-5">
<p>
    count all distinct elements in a stream.
    obvious algorithm: maintain set of elements in memory, and check for every new element
if it has been seen before.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline57"></a>flajolet-martin algorithm<br  /><div class="outline-text-5" id="text-7-1-5-1">
<p>
     This algorithm is used to estimate the distinct elements in a stream.
     non-trivial idea:
use a hash fn that hashes every stream element to atleast (log<sub>2</sub> N) bits.
let r(a) = trailing 0s in h(a).
R = maximum r(a) over all a &isin; N.
estimate = 2<sup>R</sup>. 
</p>
</div></li>
<li><a id="orgheadline58"></a>AMS method.<br  /><div class="outline-text-5" id="text-7-1-5-2">
<p>
Used for finding any moment, gives unbiased estimate.
Based on multiple random variables.
</p>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-2">
<h2 id="orgheadline73"><span class="section-number-2">8</span> Week 5 Clustering</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">8.1</span> Hierarchical clustering</h3>
<div class="outline-text-3" id="text-8-1">
<p>
   Repeatedly combine two nearest clusters.
Start at each point as a cluster.
Notion of near? 
</p>
</div>
