mmds.org
*** Euclidean case
Centroid: avg of all points
*** Non-Euclidean case
   Clustroid
   One of the points in the cluster, that is "closest" to all other points.
   What is closest?
- smallest max distance to all points
- smallest avg distance
- smallest sum of squares distance
Pick one based on application
*** When to stop clustering?
Threshold on diameter of cluster. (cohesion)
Density of cluster: no. of points/(some power of the radius)
When density lowers, stop merging.
       
       



Hierarchical clustering is pretty expensive. O(N^3) operations. using priority queues,
we can make it O(N^2 log N). not suitable for big datasets that do not fit in memory.
** K-Means algorithm
- Pick K points randomly as our cluster centers.
- For each new point, assign it to one of the k points that is nearest to it.
- re-calculate centeroid for this cluster.
- repeat until convergence.i.e points dont move much

K-means takes a long time to converge.
** Bradley-Fayed-Reina (BFR) algorithm
   Optimized for large datasets that dont fit in memory.
Scan dataset once, to cluster points.
Points are loaded in chunks into the memory, and summarized by some simple statitics.
*** Assumptions:
Points are normally distributed in euclidean space.
*** Algorithm
    First, pick some set of K points (chosen by sampling the huge dataset, and then applying
hierarchical clustering or something)
Three sets
**** Discard Set (DS)
     Points that are close to some centroid, can be used to summarize.
**** Compression Set (CS)
     Set of Points that are close together, but not close to any cluster.
**** Retained Set (RS)
* Week 7 LSH Improvements
** LSH families of Hash functions
   What is a hash fn in context of LSH?
   a fn that takes 2 arguments and returns if they are similar or not.
   Ex) LSH family = minhash, family of hash fns that compute minhash values and say whether 2 cols are similar.
   
A family H is said to be (d1, d2, p1, p2)-sensitive family if,
d1 is small and d2 is large.

for all d(x, y) < d1, p(h(x) = h(y)) > p1
for all d(x, y) > d2, p(h(x) = h(y)) < p2

S curve is such that, d2 - d1 is small, and p1 is large, p2 is small.
Checkout the minhash example in the slides. (1/3, 2/3, 2/3, 1/3)-sensitive family.
We can amplify the steepness of s curve by creating new lsh family by combining  multiple families. (AND, OR construction)
combining AND, OR construction, we get 1-(1-p^r)^b. The correct values of r and b will increase p1 and decrease p2.
*** Random Hyperplane family for cosine distance
    (d1, d2, 1-d1/180, 1-d2/180)-sensitive family

* Week 7 More about link analysis

