mmds.html
<div id="outline-container-orgheadline62" class="outline-4">
<h4 id="orgheadline62"><span class="section-number-4">8.1.1</span> Euclidean case</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Centroid: avg of all points
</p>
</div>
</div>
<div id="outline-container-orgheadline63" class="outline-4">
<h4 id="orgheadline63"><span class="section-number-4">8.1.2</span> Non-Euclidean case</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Clustroid
One of the points in the cluster, that is "closest" to all other points.
What is closest?
</p>
<ul class="org-ul">
<li>smallest max distance to all points</li>
<li>smallest avg distance</li>
<li>smallest sum of squares distance</li>
</ul>
<p>
Pick one based on application
</p>
</div>
</div>
<div id="outline-container-orgheadline64" class="outline-4">
<h4 id="orgheadline64"><span class="section-number-4">8.1.3</span> When to stop clustering?</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Threshold on diameter of cluster. (cohesion)
Density of cluster: no. of points/(some power of the radius)
When density lowers, stop merging.
</p>





<p>
Hierarchical clustering is pretty expensive. O(N<sup>3</sup>) operations. using priority queues,
we can make it O(N<sup>2</sup> log N). not suitable for big datasets that do not fit in memory.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">8.2</span> K-Means algorithm</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Pick K points randomly as our cluster centers.</li>
<li>For each new point, assign it to one of the k points that is nearest to it.</li>
<li>re-calculate centeroid for this cluster.</li>
<li>repeat until convergence.i.e points dont move much</li>
</ul>

<p>
K-means takes a long time to converge.
</p>
</div>
</div>
<div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">8.3</span> Bradley-Fayed-Reina (BFR) algorithm</h3>
<div class="outline-text-3" id="text-8-3">
<p>
   Optimized for large datasets that dont fit in memory.
Scan dataset once, to cluster points.
Points are loaded in chunks into the memory, and summarized by some simple statitics.
</p>
</div>
<div id="outline-container-orgheadline67" class="outline-4">
<h4 id="orgheadline67"><span class="section-number-4">8.3.1</span> Assumptions:</h4>
<div class="outline-text-4" id="text-8-3-1">
<p>
Points are normally distributed in euclidean space.
</p>
</div>
</div>
<div id="outline-container-orgheadline71" class="outline-4">
<h4 id="orgheadline71"><span class="section-number-4">8.3.2</span> Algorithm</h4>
<div class="outline-text-4" id="text-8-3-2">
<p>
    First, pick some set of K points (chosen by sampling the huge dataset, and then applying
hierarchical clustering or something)
Three sets
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline68"></a>Discard Set (DS)<br  /><div class="outline-text-5" id="text-8-3-2-1">
<p>
Points that are close to some centroid, can be used to summarize.
</p>
</div></li>
<li><a id="orgheadline69"></a>Compression Set (CS)<br  /><div class="outline-text-5" id="text-8-3-2-2">
<p>
Set of Points that are close together, but not close to any cluster.
</p>
</div></li>
<li><a id="orgheadline70"></a>Retained Set (RS)<br  /></li></ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline76" class="outline-2">
<h2 id="orgheadline76"><span class="section-number-2">9</span> Week 7 LSH Improvements</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline75" class="outline-3">
<h3 id="orgheadline75"><span class="section-number-3">9.1</span> LSH families of Hash functions</h3>
<div class="outline-text-3" id="text-9-1">
<p>
What is a hash fn in context of LSH?
a fn that takes 2 arguments and returns if they are similar or not.
Ex) LSH family = minhash, family of hash fns that compute minhash values and say whether 2 cols are similar.
</p>

<p>
A family H is said to be (d1, d2, p1, p2)-sensitive family if,
d1 is small and d2 is large.
</p>

<p>
for all d(x, y) &lt; d1, p(h(x) = h(y)) &gt; p1
for all d(x, y) &gt; d2, p(h(x) = h(y)) &lt; p2
</p>

<p>
S curve is such that, d2 - d1 is small, and p1 is large, p2 is small.
Checkout the minhash example in the slides. (1/3, 2/3, 2/3, 1/3)-sensitive family.
We can amplify the steepness of s curve by creating new lsh family by combining  multiple families. (AND, OR construction)
combining AND, OR construction, we get 1-(1-p<sup>r</sup>)<sup>b</sup>. The correct values of r and b will increase p1 and decrease p2.
</p>
</div>
<div id="outline-container-orgheadline74" class="outline-4">
<h4 id="orgheadline74"><span class="section-number-4">9.1.1</span> Random Hyperplane family for cosine distance</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
(d1, d2, 1-d1/180, 1-d2/180)-sensitive family
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline77" class="outline-2">
<h2 id="orgheadline77"><span class="section-number-2">10</span> Week 7 More about link analysis</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: siddharth subramaniyam</p>
<p class="date">Created: 2016-10-11 Tue 16:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
